## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [4]:
# Your code here - remember to use markdown cells for comments as well!

In [5]:
# Importing the necessary libraries
import pandas as pd 
import numpy as np
import sqlite3
import matplotlib.pyplot as plt

In [6]:
bom_df = pd.read_csv("bom.movie_gross.csv")
bom_df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [7]:
#Connect to the SQlite database for im.db
conn = sqlite3.connect("im.db")
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
tables = cursor.fetchall()
tables

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

In [8]:
import pandas as pd

# Example of loading a few rows from the movies table
movies_sample = pd.read_sql_query("SELECT * FROM movie_basics LIMIT 5;", conn)
print("Movies Table Sample:\n", movies_sample)

# Similarly, you can check other tables
ratings_sample = pd.read_sql_query("SELECT * FROM movie_ratings LIMIT 5;", conn)
print("Ratings Table Sample:\n", ratings_sample)

Movies Table Sample:
     movie_id                    primary_title              original_title  \
0  tt0063540                        Sunghursh                   Sunghursh
1  tt0066787  One Day Before the Rainy Season             Ashad Ka Ek Din
2  tt0069049       The Other Side of the Wind  The Other Side of the Wind
3  tt0069204                  Sabse Bada Sukh             Sabse Bada Sukh
4  tt0100275         The Wandering Soap Opera       La Telenovela Errante

   start_year  runtime_minutes                genres
0        2013            175.0    Action,Crime,Drama
1        2019            114.0       Biography,Drama
2        2018            122.0                 Drama
3        2018              NaN          Comedy,Drama
4        2017             80.0  Comedy,Drama,Fantasy
Ratings Table Sample:
      movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [9]:
query = pd.read_sql("SELECT * FROM movie_basics", conn)
query

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

In [10]:
query = pd.read_sql("SELECT * FROM movie_ratings", conn)
query

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [11]:
#Joining movie_basics table and movie_ratings table
imdb_data = pd.read_sql_query("""
     SELECT movie_basics.movie_id,
            movie_basics.primary_title,
            movie_basics.original_title,
            movie_basics.start_year,
            movie_basics.runtime_minutes, 
            movie_basics.genres,
            movie_ratings.averagerating,
            movie_ratings.numvotes 
     FROM movie_basics
     JOIN movie_ratings ON movie_basics.movie_id = movie_ratings.movie_id
""", conn)

imdb_data

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119
...,...,...,...,...,...,...,...,...
73851,tt9913084,Diabolik sono io,Diabolik sono io,2019,75.0,Documentary,6.2,6
73852,tt9914286,Sokagin Ã‡ocuklari,Sokagin Ã‡ocuklari,2019,98.0,"Drama,Family",8.7,136
73853,tt9914642,Albatross,Albatross,2017,NaN,Documentary,8.5,8
73854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,NaN,None,6.6,5
73855,tt9916160,DrÃ¸mmeland,DrÃ¸mmeland,2019,72.0,Documentary,6.5,11

In [12]:
movie_budgets = pd.read_csv("tn.movie_budgets.csv")
movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [13]:
movies = pd.read_csv("tmdb.movies.csv")
movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

# Data Cleaning

#### 1. Handling Missing Values

In [14]:
#Check data types of domestic_gross and foreign_gross columns
print(bom_df[['domestic_gross', 'foreign_gross']].dtypes)

#Convert domestic_gross and foreign_gross to numeric after removing commas, handling errors with coerce
bom_df['domestic_gross'] = pd.to_numeric(bom_df['domestic_gross'].astype(str).str.replace(',', '', regex=False), errors ='coerce')
bom_df['foreign_gross'] = pd.to_numeric(bom_df['foreign_gross'].astype(str).str.replace(',', '', regex=False), errors ='coerce')

#Check data types after conversion
print("\nData types after conversion:")
print(bom_df[['domestic_gross', 'foreign_gross']].dtypes)

#Fill missing values in domestic_gross and foreign_gross with the median in bom_df
bom_df['domestic_gross'].fillna(bom_df['domestic_gross'].median(), inplace=True)
bom_df['foreign_gross'].fillna(bom_df['foreign_gross'].median(), inplace=True)
    
#Handle missing values in studio column and fill with Unknown
if 'studio' in bom_df.columns:
    bom_df['studio'].fillna('Unknown', inplace=True)

#Handle missing values in imdb_data dataframe, checking if the columns exist
if 'original_title' in imdb_data.columns:
    imdb_data['original_title'].fillna('Unknown', inplace=True)

if 'runtime_minutes' in imdb_data.columns:
    imdb_data['runtime_minutes'].fillna(imdb_data['runtime_minutes'].median(), inplace=True)
    
if 'genres' in imdb_data.columns:
    imdb_data['genres'].fillna('Unknown', inplace=True)

#Fill missing values with zero
movie_budgets['production_budget'].fillna(0, inplace=True)
movie_budgets['domestic_gross'].fillna(0, inplace=True)
movie_budgets['worldwide_gross'].fillna(0, inplace=True)

#Drop 'Unnamed: 0' column in movies if it exists
movies.drop(columns=['Unnamed: 0'], inplace=True, errors='ignore')

#Final check for missing values in each dataset
print("\nCheck for missing values:")
print("\nbom_df:", bom_df.isnull().sum())
print("\nimdb_data:", imdb_data.isnull().sum())
print("\nmovies:", movies.isnull().sum())
print("\nmovie_budgets:", movie_budgets.isnull().sum())

domestic_gross    float64
foreign_gross      object
dtype: object

Data types after conversion:
domestic_gross    float64
foreign_gross     float64
dtype: object

Check for missing values:

bom_df: title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

imdb_data: movie_id           0
primary_title      0
original_title     0
start_year         0
runtime_minutes    0
genres             0
averagerating      0
numvotes           0
dtype: int64

movies: genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

movie_budgets: id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

#### 2. Removing Duplicates

In [15]:
#Remove duplicates from imdb_data
print("Duplicates in imdb_data before removal:", imdb_data.duplicated().sum())
imdb_data.drop_duplicates(inplace=True)
print("Duplicates in imdb_data after removal:", imdb_data.duplicated().sum())

#Remove duplicates from bom_df
print("Duplicates in bom_df before removal:", bom_df.duplicated().sum())
bom_df.drop_duplicates(inplace=True)
print("Duplicates in bom_df after removal:", bom_df.duplicated().sum())

#Remove duplicates from movies
print("Duplicates in movies before removal:", movies.duplicated().sum())
movies.drop_duplicates(inplace=True)
print("Duplicates in movies after removal:", movies.duplicated().sum())

#Remove duplicates from movie_budgets
print("Duplicates in movie_budgets before removal:", movie_budgets.duplicated().sum())
movie_budgets.drop_duplicates(inplace=True)
print("Duplicates in movie_budgets after removal:", movie_budgets.duplicated().sum())

Duplicates in imdb_data before removal: 0
Duplicates in imdb_data after removal: 0
Duplicates in bom_df before removal: 0
Duplicates in bom_df after removal: 0
Duplicates in movies before removal: 1020
Duplicates in movies after removal: 0
Duplicates in movie_budgets before removal: 0
Duplicates in movie_budgets after removal: 0

#### 3. Creation of a new column

In [16]:
#Check if the required columns exist
if 'domestic_gross' in bom_df.columns and 'foreign_gross' in bom_df.columns:
    #Convert to numeric, handling errors by coercing invalid parsing to NaN
    bom_df['domestic_gross'] = pd.to_numeric(bom_df['domestic_gross'].fillna(0), errors='coerce')
    bom_df['foreign_gross'] = pd.to_numeric(bom_df['foreign_gross'].fillna(0), errors='coerce')  
    
    #Calculate total gross revenue
    bom_df['total_gross'] = bom_df['domestic_gross'] + bom_df['foreign_gross']
    
    #Set pandas display options to show numbers in standard format
    pd.set_option('display.float_format', '{:.2f}'.format)
    
    #Display the first few rows to verify the new column
    print(bom_df[['domestic_gross', 'foreign_gross', 'total_gross']].head())
else:
    print("Required columns 'domestic_gross' or 'foreign_gross' are missing from the DataFrame.")

   domestic_gross  foreign_gross   total_gross
0    415000000.00   652000000.00 1067000000.00
1    334200000.00   691300000.00 1025500000.00
2    296000000.00   664300000.00  960300000.00
3    292600000.00   535700000.00  828300000.00
4    238700000.00   513900000.00  752600000.00

#### 4. Checking for outliers

In [35]:
#WRITTEN
#Function to calculate summary statistics for a given column
def summarize_column(df, column):
    if column in df.columns:
        return df[column].describe()
    else:
        raise ValueError(f"Column '{column}' does not exist in the dataframe.")

#Function to count outliers using IQR method
def count_outliers(df, column):
    if column in df.columns:
        Q1 = df[column].quantile(0.25)
        Q3 = df[column].quantile(0.75)
        IQR = Q3 - Q1
        lower_bound = Q1 - 1.5 * IQR
        upper_bound = Q3 + 1.5 * IQR
        return df[(df[column] < lower_bound) | (df[column] > upper_bound)].shape[0]
    else:
        raise ValueError(f"Column '{column}' does not exist in the dataframe.")                         

#Function to count outliers using IQR method
def remove_outliers_iqr(df, column):
    if column in df.columns:
        Q1 = df[column].quantile(0.25)
        Q3 = df[column].quantile(0.75)
        IQR = Q3 - Q1
        lower_bound = Q1 - 1.5 * IQR
        upper_bound = Q3 + 1.5 * IQR
        return df[(df[column] >= lower_bound) & (df[column] <= upper_bound)]
    else:
        raise ValueError(f"Column '{column}' does not exist in the dataframe.")
                         
#Check if imdb_data is a dataframe
if isinstance(imdb_data, pd.DataFrame):
    #Check summary statistics before removing outliers
    print("Summary statistics before removing outliers:")
    print(summarize_column(imdb_data, 'averagerating'))
    print(summarize_column(imdb_data, 'numvotes'))
                         
    #Count the number of outliers before removal
    outliers_before_avg_rating = count_outliers(imdb_data, 'averagerating')
    outliers_before_num_votes = count_outliers(imdb_data, 'numvotes')
                         
    #Remove outliers for avg_rating in imdb_data
    imdb_data = remove_outliers_iqr(imdb_data, 'averagerating')
                         
    #Remove outliers for num_votes in imdb_data
    imdb_data = remove_outliers_iqr(imdb_data, 'numvotes')
                         
    #Check summary statistics after removing outliers
    print("\nSummary statistics after removing outliers:")
    print(summarize_column(imdb_data, 'averagerating'))
    print(summarize_column(imdb_data, 'numvotes'))
                         
    #Count the number of outliers after removal
    outliers_after_avg_rating = count_outliers(imdb_data, 'averagerating')
    outliers_after_num_votes = count_outliers(imdb_data, 'numvotes')
                         
    #Print the number of outliers before and after removal
    print(f"\nNumber of outliers in 'averagerating' before: {outliers_before_avg_rating}, after: {outliers_after_avg_rating}")
    print(f"Number of outliers in 'numvotes' before: {outliers_before_num_votes}, after: {outliers_after_num_votes}")
else:
    print("The query did not return a DataFrame.")

Summary statistics before removing outliers:
count   61037.00
mean        6.44
std         1.42
min         2.70
25%         5.50
50%         6.60
75%         7.50
max        10.00
Name: averagerating, dtype: float64
count   61037.00
mean       95.33
std       139.44
min         5.00
25%        12.00
50%        31.00
75%       112.00
max       684.00
Name: numvotes, dtype: float64

Summary statistics after removing outliers:
count   53884.00
mean        6.51
std         1.42
min         2.70
25%         5.60
50%         6.60
75%         7.50
max        10.00
Name: averagerating, dtype: float64
count   53884.00
mean       51.27
std        59.83
min         5.00
25%        10.00
50%        24.00
75%        68.00
max       262.00
Name: numvotes, dtype: float64

Number of outliers in 'averagerating' before: 0, after: 111
Number of outliers in 'numvotes' before: 7153, after: 4786

#### 5. Standardizing genres and normalizing year formats in movie_basics

In [36]:
movie_basics = pd.read_sql_query("SELECT * FROM movie_basics", conn)

#Consistent formats for genres
def standardize_genres(genres):
    if isinstance(genres, str):
        return [genre.strip() for genre in genres.split(',')]
    return genres

movie_basics['genres'] = movie_basics['genres'].apply(standardize_genres)

#Normalize year formats in start_year to a standard year format
#Ensure all values in start_year are integers and replace invalid years with NaN
movie_basics['start_year'] = pd.to_numeric(movie_basics['start_year'], errors='coerce')

#Checking results
print("\nUpdated movie_basics:")
print(movie_basics[['genres', 'start_year']].head())

Updated movie_basics:
                     genres  start_year
0    [Action, Crime, Drama]        2013
1        [Biography, Drama]        2019
2                   [Drama]        2018
3           [Comedy, Drama]        2018
4  [Comedy, Drama, Fantasy]        2017

#### 6. Removing commas from numerical columns in csv files

In [37]:
#Function to clean numerical columns by removing commas and converting to numeric
def clean_numerical_column(df, column):
    df[column] = pd.to_numeric(df[column].astype(str).str.replace(',', '', regex=False), errors='coerce')

#Remove commas and convert columns to numeric in bom_df
clean_numerical_column(bom_df, 'domestic_gross')
clean_numerical_column(bom_df, 'foreign_gross')

#Remove commas and convert columns to numeric in movies
clean_numerical_column(movies, 'popularity')

#Check results
print("\nUpdated bom_df:")
print(bom_df[['domestic_gross', 'foreign_gross']].head())

print("\nUpdated movies:")
print(movies[['popularity']].head())

Updated bom_df:
   domestic_gross  foreign_gross
0    415000000.00   652000000.00
1    334200000.00   691300000.00
2    296000000.00   664300000.00
3    292600000.00   535700000.00
4    238700000.00   513900000.00

Updated movies:
   popularity
0       33.53
1       28.73
2       28.52
3       28.00
4       27.92